#+TITLE: Test

* IPMap
#+begin_src python -r -n :results output :exports both
import pandas as pd
from mapsplotlib import mapsplot as mplt
from gmplot import gmplot
import numpy as np
import subprocess, os, platform 

import IP2Location

IP2LocObj = IP2Location.IP2Location()
IP2LocObj.open("/Users/letranger/Downloads/IP2L/IP2LOCATION-LITE-DB5.BIN")

df = pd.read_csv("~/Downloads/ips.txt", header=None)
df.columns = ["ip"]

def ipInfo(addr=''):
    from urllib.request import urlopen
    from json import load
    if addr == '':
        url = 'https://ipinfo.io/json'
    else:
        url = 'https://ipinfo.io/' + addr + '/json'
    res = urlopen(url)
    #response from url(if res==None then check connection)
    data = load(res)

    return float(data['loc'].split(',')[0]), float(data['loc'].split(',')[1])

lat_values = []
lon_values = []
for ip in df.ip:
    #lat, lon = ipInfo(ip)

    lat = IP2LocObj.get_all(ip).latitude
    lon = IP2LocObj.get_all(ip).longitude
    lat_values.append(lat)
    lon_values.append(lon)
center_lat = np.mean(lat_values)
center_lon = np.mean(lon_values)
#
center_lon = lon
zoom = 5
#
gmap = gmplot.GoogleMapPlotter(center_lat, center_lon, zoom)
gmap.apikey = "AIzaSyDeRNMnZ__VnQDiATiuz4kPjF_c9r1kWe8"
#gmap.apikey = "p9gd5OxUypv12GIr3lvBKepcJi0"
gmap.scatter(lat_values, lon_values)
gmap.draw('my_map.html')
subprocess.call(('open', 'my_map.html'))
#+end_src

#+RESULTS:
*

* Python 語法
#+BEGIN_SRC python :results output :exports both
x = 3
print(x)
y = 5.5
print(y)
z = x+y
print(z)

school = 'TNFSH'
for x in school:
    print(x, end='\t')
school.l
#+END_SRC

#+RESULTS:
: 3
: 5.5
: 8.5
: T	N	F	S	H







* CPP 語法
#+BEGIN_SRC cpp :results output :exports both
#include <iostream>
using namespace std;
int main() {
  int a = 10;
  printf("%d", a);

  return 0;
}
#+END_SRC

#+RESULTS:
: 10

* pytube
#+begin_src shell -r -n :results output :exports both
wget https://www.youtube.com/watch?v=VzR45-zIjhQ
wget https://www.youtube.com/watch?v=lAyZNjSgnUY
wget https://www.youtube.com/watch?v=tuiMDq3QF-o
wget https://www.youtube.com/watch?v=GqN_8MLafKU
wget https://www.youtube.com/watch?v=BT2L3Y9sNwA
wget https://www.youtube.com/watch?v=TZCRISnsgrs
wget https://www.youtube.com/watch?v=h090go98yuM
wget https://www.youtube.com/watch?v=EUzP5PMuFxA
wget https://www.youtube.com/watch?v=DQbyufFCZ5o
wget https://www.youtube.com/watch?v=pQZEk2WilB0
wget https://www.youtube.com/watch?v=PrKqvo8nbEs
wget https://www.youtube.com/watch?v=YPEzwXnW0qE
wget https://www.youtube.com/watch?v=xVhYT6pn0ho
wget https://www.youtube.com/watch?v=z11n-gLWbnY
wget https://www.youtube.com/watch?v=YXu5Ub6Kykk
wget https://www.youtube.com/watch?v=3ClFn9lO9LY
wget https://www.youtube.com/watch?v=QtEU6bUoBO0
wget https://www.youtube.com/watch?v=92beOVMhQ-w
wget https://www.youtube.com/watch?v=MmCJIMqT73Y
wget https://www.youtube.com/watch?v=aY2-8hG8HAk
#+end_src

* Go
[[https://gobyexample.com/][Go by Example]]

#+begin_src go -r -n :results output :exports both
package main

import "fmt"

func main() {
	fmt.Println("hello world")

	var a = "Letranger"
	fmt.Println(a)

	var b, c int = 10, 20
	fmt.Println(b*c, b+c)
}
#+end_src

#+RESULTS:
: hello world
: Letranger
: 200 30
